gwsystems/composite/src/platform/cmx/src/cmsis/startup_stm32f767.c
/**
  ******************************************************************************
  * @file    startup_stm32f767.c
  * @author  pry,MCD Application Team
  * @version V1.0.0
  * @date    22-April-2016
  * @brief   CMSIS Cortex-M7 Device STM32F767 Startup File, derived from ST code.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include <stdint.h>
#include <sys/types.h>
#include "cmsis_device.h"
#include "stm32f7xx_hal_conf.h"

extern unsigned int __vectors_start;
extern unsigned int _estack;
extern unsigned int _sidata;
extern unsigned int _sdata;
extern unsigned int _edata;
extern unsigned int __bss_start__;
extern unsigned int __bss_end__;

extern unsigned int _c1_sidata;
extern unsigned int _c1_sdata;
extern unsigned int _c1_edata;
extern unsigned int __c1_bss_start__;
extern unsigned int __c1_bss_end__;

/* newlib; main function defined as int main(void) */
extern void __initialize_args (void);
extern int main (void);

/* Initialize the clock for STM32. code derived from Alientek */
void Stm32_Clock_Init(unsigned int plln,unsigned int pllm,unsigned int pllp,unsigned int pllq)
{
    HAL_StatusTypeDef ret = HAL_OK;
    RCC_OscInitTypeDef RCC_OscInitStructure;
    RCC_ClkInitTypeDef RCC_ClkInitStructure;

    __HAL_RCC_PWR_CLK_ENABLE();

    __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

    RCC_OscInitStructure.OscillatorType=RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStructure.HSEState=RCC_HSE_ON;
    RCC_OscInitStructure.PLL.PLLState=RCC_PLL_ON;
    RCC_OscInitStructure.PLL.PLLSource=RCC_PLLSOURCE_HSE;
    RCC_OscInitStructure.PLL.PLLM=pllm;
    RCC_OscInitStructure.PLL.PLLN=plln;
    RCC_OscInitStructure.PLL.PLLP=pllp;
    RCC_OscInitStructure.PLL.PLLQ=pllq;
    ret=HAL_RCC_OscConfig(&RCC_OscInitStructure);
    if(ret!=HAL_OK) while(1);

    ret=HAL_PWREx_EnableOverDrive();
    if(ret!=HAL_OK) while(1);

    RCC_ClkInitStructure.ClockType=(RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2);
    RCC_ClkInitStructure.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStructure.AHBCLKDivider=RCC_SYSCLK_DIV1;
    RCC_ClkInitStructure.APB1CLKDivider=RCC_HCLK_DIV4;
    RCC_ClkInitStructure.APB2CLKDivider=RCC_HCLK_DIV2;

    ret=HAL_RCC_ClockConfig(&RCC_ClkInitStructure,FLASH_LATENCY_7);
    if(ret!=HAL_OK) while(1);
}

void __attribute__ ((section(".after_vectors"),noreturn))
_start (void)
{
	unsigned int* src;
	unsigned int* ptr;

	/* system init after rst */
	SystemInit();
	/* set vector to linker script positions */
	SCB->VTOR = (uint32_t)(&__vectors_start);
        /* PC-relative loading */
	//ptr=0x12345678;

	/* no C++ inits done by this func so cannot use cpp */
	/* data section initialization */
	ptr=&_sdata;
	src=&_sidata;
	for(;ptr<&_edata;ptr++,src++)
		*ptr=*src;
	/* bss section initialization */
	for(ptr=&__bss_start__;ptr<&__bss_end__;ptr++)
		*ptr=0;

	/* This is for component 1 */
	/* data section initialization */
	for(ptr=&_c1_sdata,src=&_c1_sidata;ptr<&_c1_edata;ptr++,src++)
		*ptr=*src;
	/* bss section initialization */
	for(ptr=&__c1_bss_start__;ptr<&__c1_bss_end__;ptr++)
		*ptr=0;

	/* fpu enabled? */
	/* SCB->CPACR |= (0xF << 20); */
	Stm32_Clock_Init(432,25,2,9);
	SystemCoreClockUpdate();

	/* Enable cache */
	SCB_EnableICache();
	SCB_EnableDCache();
	/* Force write through or we may encounter errors */
	SCB->CACR|=1<<2;

	/* Enable all fault handlers */
	SCB->SHCSR|=0x00030000;/*enable Usage Fault, Bus Fault, and MMU Fault*/

	/* call into main and never return */
  	main();
  	/* reset the machine if main quit */
  	NVIC_SystemReset();
  	/* never return, should not get here */
  	while(1);
}

void
_exit(int code)
{
	/* always a system reset */
	NVIC_SystemReset();
}

int
_kill(int pid, int sig)
{
	return -1;
}

int
_getpid(void)
{
	return -1;
}

char*
_sbrk(int incr)
{
	/* defined by the linker */
	extern char _Heap_Limit;
	return (char*)(&_Heap_Limit);
}

/* interrupt handlers */
void __attribute__ ((section(".after_vectors"),noreturn))
Reset_Handler (void)
{
  _start ();
}

void __attribute__ ((section(".after_vectors"),weak))
NMI_Handler (void)
{
	while(1);
}

extern char str[100];
extern void LED_reset(void);
typedef unsigned short u16;
typedef unsigned char u8;
extern void LCD_ShowString(u16 x,u16 y,u16 width,u16 height,u8 size,u8 *p);

void __attribute__ ((section(".after_vectors"),weak))
HardFault_Handler (void)
{
	LED_reset();
	sprintf(str,"CCR value : 0x%8x", SCB->CCR);
	LCD_ShowString(20,20,260,32,12,str);
	sprintf(str,"HFSR value : 0x%8x", SCB->HFSR);
	LCD_ShowString(20,40,260,32,12,str);
	sprintf(str,"CFSR value : 0x%8x", SCB->CFSR);
	LCD_ShowString(20,60,260,32,12,str);
	while(1);
}

void __attribute__ ((section(".after_vectors"),weak))
MemManage_Handler (void)
{
	while(1);
}

void __attribute__ ((section(".after_vectors"),weak))
BusFault_Handler (void)
{
	while(1);
}

void __attribute__ ((section(".after_vectors"),weak))
UsageFault_Handler (void)
{
	while(1);
}

void __attribute__ ((section(".after_vectors"),naked))
SVC_Handler (void)
{
	/* Here, the stack of the Cortex-M3 should be xplained. this will require modification of this
	 * code to make the thd switch actually work.
	 * dditionally, this will require modifications on the parameter passing to make sure it works.
	 * regs are saved on the user stack, so r0-r3 still cannot be used as retvals. modification of the r15_pc is impossible too. */
        __asm__ __volatile__("push {lr} \n"
                             "push {r0-r12} \n"

