gwsystems/composite/src/platform/cmx/src/cmsis/startup_stm32f767.c
    			     "mrs r0,psp \n"
    			     "push {r0} \n"
			     "push {lr} \n"
    			     "mov r0,pc \n"
			     "push {r0} \n"
			     "mrs r0,xpsr \n"
			     "push {r0} \n"
			     "mov  r0,sp \n"

			     "bl composite_syscall_handler \n"

			     "pop {r0} \n"   /* xpsr */
			     "pop {r0} \n"   /* pc */
    			     "pop {r0} \n"   /* lr */
    			     "pop {r0} \n"   /* psp */
			     "msr psp,r0 \n"

			     "pop {r0-r12} \n"
			     "pop {pc} \n":::);
}

void __attribute__ ((section(".after_vectors"),weak))
DebugMon_Handler (void)
{
	while(1);
}

void __attribute__ ((section(".after_vectors"),weak))
PendSV_Handler (void)
{
	while(1);
}

void __attribute__ ((section(".after_vectors"),weak))
SysTick_Handler (void)
{
	return;
}

void __attribute__ ((section(".after_vectors"),weak))
Default_Handler(void)
{
	while(1);
}

#define EINT_HANDLER __attribute__ ((weak, alias ("Default_Handler")))
void EINT_HANDLER WWDG_IRQHandler(void);                   /* Window WatchDog */
void EINT_HANDLER PVD_IRQHandler(void);                    /* PVD through EXTI Line detection */
void EINT_HANDLER TAMP_STAMP_IRQHandler(void);             /* Tamper and TimeStamps through the EXTI line */
void EINT_HANDLER RTC_WKUP_IRQHandler(void);               /* RTC Wakeup through the EXTI line */
void EINT_HANDLER FLASH_IRQHandler(void);                  /* FLASH */
void EINT_HANDLER RCC_IRQHandler(void);                    /* RCC */
void EINT_HANDLER EXTI0_IRQHandler(void);                  /* EXTI Line0 */
void EINT_HANDLER EXTI1_IRQHandler(void);                  /* EXTI Line1 */
void EINT_HANDLER EXTI2_IRQHandler(void);                  /* EXTI Line2 */
void EINT_HANDLER EXTI3_IRQHandler(void);                  /* EXTI Line3 */
void EINT_HANDLER EXTI4_IRQHandler(void);                  /* EXTI Line4 */
void EINT_HANDLER DMA1_Stream0_IRQHandler(void);           /* DMA1 Stream 0 */
void EINT_HANDLER DMA1_Stream1_IRQHandler(void);           /* DMA1 Stream 1 */
void EINT_HANDLER DMA1_Stream2_IRQHandler(void);           /* DMA1 Stream 2 */
void EINT_HANDLER DMA1_Stream3_IRQHandler(void);           /* DMA1 Stream 3 */
void EINT_HANDLER DMA1_Stream4_IRQHandler(void);           /* DMA1 Stream 4 */
void EINT_HANDLER DMA1_Stream5_IRQHandler(void);           /* DMA1 Stream 5 */
void EINT_HANDLER DMA1_Stream6_IRQHandler(void);           /* DMA1 Stream 6 */
void EINT_HANDLER ADC_IRQHandler(void);                    /* ADC1(void); ADC2 and ADC3s */
void EINT_HANDLER CAN1_TX_IRQHandler(void);                /* CAN1 TX */
void EINT_HANDLER CAN1_RX0_IRQHandler(void);               /* CAN1 RX0 */
void EINT_HANDLER CAN1_RX1_IRQHandler(void);               /* CAN1 RX1 */
void EINT_HANDLER CAN1_SCE_IRQHandler(void);               /* CAN1 SCE */
void EINT_HANDLER EXTI9_5_IRQHandler(void);                /* External Line[9:5]s */
void EINT_HANDLER TIM1_BRK_TIM9_IRQHandler(void);          /* TIM1 Break and TIM9 */
void EINT_HANDLER TIM1_UP_TIM10_IRQHandler(void);          /* TIM1 Update and TIM10 */
void EINT_HANDLER TIM1_TRG_COM_TIM11_IRQHandler(void);     /* TIM1 Trigger and Commutation and TIM11 */
void EINT_HANDLER TIM1_CC_IRQHandler(void);                /* TIM1 Capture Compare */
void EINT_HANDLER TIM2_IRQHandler(void);                   /* TIM2 */
//void EINT_HANDLER TIM3_IRQHandler(void);                   /* TIM3 */
void EINT_HANDLER TIM4_IRQHandler(void);                   /* TIM4 */
void EINT_HANDLER I2C1_EV_IRQHandler(void);                /* I2C1 Event */
void EINT_HANDLER I2C1_ER_IRQHandler(void);                /* I2C1 Error */
void EINT_HANDLER I2C2_EV_IRQHandler(void);                /* I2C2 Event */
void EINT_HANDLER I2C2_ER_IRQHandler(void);                /* I2C2 Error */
void EINT_HANDLER SPI1_IRQHandler(void);                   /* SPI1 */
void EINT_HANDLER SPI2_IRQHandler(void);                   /* SPI2 */
void EINT_HANDLER USART1_IRQHandler(void);                 /* USART1 */
void EINT_HANDLER USART2_IRQHandler(void);                 /* USART2 */
void EINT_HANDLER USART3_IRQHandler(void);                 /* USART3 */
void EINT_HANDLER EXTI15_10_IRQHandler(void);              /* External Line[15:10]s */
void EINT_HANDLER RTC_Alarm_IRQHandler(void);              /* RTC Alarm (A and B) through EXTI Line */
void EINT_HANDLER OTG_FS_WKUP_IRQHandler(void);            /* USB OTG FS Wakeup through EXTI line */
void EINT_HANDLER TIM8_BRK_TIM12_IRQHandler(void);         /* TIM8 Break and TIM12 */
void EINT_HANDLER TIM8_UP_TIM13_IRQHandler(void);          /* TIM8 Update and TIM13 */
void EINT_HANDLER TIM8_TRG_COM_TIM14_IRQHandler(void);     /* TIM8 Trigger and Commutation and TIM14 */
void EINT_HANDLER TIM8_CC_IRQHandler(void);                /* TIM8 Capture Compare */
void EINT_HANDLER DMA1_Stream7_IRQHandler(void);           /* DMA1 Stream7 */
void EINT_HANDLER FMC_IRQHandler(void);                    /* FMC */
void EINT_HANDLER SDMMC1_IRQHandler(void);                 /* SDMMC1 */
void EINT_HANDLER TIM5_IRQHandler(void);                   /* TIM5 */
void EINT_HANDLER SPI3_IRQHandler(void);                   /* SPI3 */
void EINT_HANDLER UART4_IRQHandler(void);                  /* UART4 */
void EINT_HANDLER UART5_IRQHandler(void);                  /* UART5 */
void EINT_HANDLER TIM6_DAC_IRQHandler(void);               /* TIM6 and DAC1&2 underrun errors */
void EINT_HANDLER TIM7_IRQHandler(void);                   /* TIM7 */
void EINT_HANDLER DMA2_Stream0_IRQHandler(void);           /* DMA2 Stream 0 */
void EINT_HANDLER DMA2_Stream1_IRQHandler(void);           /* DMA2 Stream 1 */
void EINT_HANDLER DMA2_Stream2_IRQHandler(void);           /* DMA2 Stream 2 */
void EINT_HANDLER DMA2_Stream3_IRQHandler(void);           /* DMA2 Stream 3 */
void EINT_HANDLER DMA2_Stream4_IRQHandler(void);           /* DMA2 Stream 4 */
void EINT_HANDLER ETH_IRQHandler(void);                    /* Ethernet */
void EINT_HANDLER ETH_WKUP_IRQHandler(void);               /* Ethernet Wakeup through EXTI line */
void EINT_HANDLER CAN2_TX_IRQHandler(void);                /* CAN2 TX */
void EINT_HANDLER CAN2_RX0_IRQHandler(void);               /* CAN2 RX0 */
void EINT_HANDLER CAN2_RX1_IRQHandler(void);               /* CAN2 RX1 */
void EINT_HANDLER CAN2_SCE_IRQHandler(void);               /* CAN2 SCE */
void EINT_HANDLER OTG_FS_IRQHandler(void);                 /* USB OTG FS */
void EINT_HANDLER DMA2_Stream5_IRQHandler(void);           /* DMA2 Stream 5 */
void EINT_HANDLER DMA2_Stream6_IRQHandler(void);           /* DMA2 Stream 6 */
void EINT_HANDLER DMA2_Stream7_IRQHandler(void);           /* DMA2 Stream 7 */
void EINT_HANDLER USART6_IRQHandler(void);                 /* USART6 */
void EINT_HANDLER I2C3_EV_IRQHandler(void);                /* I2C3 event */
void EINT_HANDLER I2C3_ER_IRQHandler(void);                /* I2C3 error */
void EINT_HANDLER OTG_HS_EP1_OUT_IRQHandler(void);         /* USB OTG HS End Point 1 Out */
void EINT_HANDLER OTG_HS_EP1_IN_IRQHandler(void);          /* USB OTG HS End Point 1 In */
void EINT_HANDLER OTG_HS_WKUP_IRQHandler(void);            /* USB OTG HS Wakeup through EXTI */
void EINT_HANDLER OTG_HS_IRQHandler(void);                 /* USB OTG HS */
void EINT_HANDLER DCMI_IRQHandler(void);                   /* DCMI */
void EINT_HANDLER RNG_IRQHandler(void);                    /* Rng */
void EINT_HANDLER FPU_IRQHandler(void);                    /* FPU */
void EINT_HANDLER UART7_IRQHandler(void);                  /* UART7 */
void EINT_HANDLER UART8_IRQHandler(void);                  /* UART8 */
void EINT_HANDLER SPI4_IRQHandler(void);                   /* SPI4 */
void EINT_HANDLER SPI5_IRQHandler(void);                   /* SPI5 */
void EINT_HANDLER SPI6_IRQHandler(void);                   /* SPI6 */
void EINT_HANDLER SAI1_IRQHandler(void);                   /* SAI1 */
void EINT_HANDLER LTDC_IRQHandler(void);                   /* LTDC */
void EINT_HANDLER LTDC_ER_IRQHandler(void);                /* LTDC error */
void EINT_HANDLER DMA2D_IRQHandler(void);                  /* DMA2D */
void EINT_HANDLER SAI2_IRQHandler(void);                   /* SAI2 */
void EINT_HANDLER QUADSPI_IRQHandler(void);                /* QUADSPI */
void EINT_HANDLER LPTIM1_IRQHandler(void);                 /* LPTIM1 */
void EINT_HANDLER CEC_IRQHandler(void);                    /* HDMI_CEC */
void EINT_HANDLER I2C4_EV_IRQHandler(void);                /* I2C4 Event */
void EINT_HANDLER I2C4_ER_IRQHandler(void);                /* I2C4 Error */
void EINT_HANDLER SPDIF_RX_IRQHandler(void);               /* SPDIF_RX */
void EINT_HANDLER DFSDM1_FLT0_IRQHandler(void);            /* DFSDM1 Filter 0 global Interrupt */
void EINT_HANDLER DFSDM1_FLT1_IRQHandler(void);            /* DFSDM1 Filter 1 global Interrupt */
void EINT_HANDLER DFSDM1_FLT2_IRQHandler(void);            /* DFSDM1 Filter 2 global Interrupt */
void EINT_HANDLER DFSDM1_FLT3_IRQHandler(void);            /* DFSDM1 Filter 3 global Interrupt */
void EINT_HANDLER SDMMC2_IRQHandler(void);                 /* SDMMC2 */
void EINT_HANDLER CAN3_TX_IRQHandler(void);                /* CAN3 TX */
void EINT_HANDLER CAN3_RX0_IRQHandler(void);               /* CAN3 RX0 */
void EINT_HANDLER CAN3_RX1_IRQHandler(void);               /* CAN3 RX1 */
void EINT_HANDLER CAN3_SCE_IRQHandler(void);               /* CAN3 SCE */
void EINT_HANDLER JPEG_IRQHandler(void);                   /* JPEG */
void EINT_HANDLER MDIOS_IRQHandler(void);                  /* MDIOS */

/* This is the real tim3 handler */
void __attribute__ ((section(".after_vectors"),naked))
TIM3_IRQHandler(void)
{
	/* The assembly is similar with the svc call */
	__asm__ __volatile__("push {lr} \n"
			     "push {r0-r12} \n"

